Add new groovy mapper with dsl.
